---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
source: html/04b61f12-1d1c-60d4-9877-765726d5a62f.htm
---
# StructuralSectionGeneralH Methods

Returns size of the section boundary.